RSN/src/InformationRegisters/УчастникиПочтовойРассылки/УчастникиПочтовойРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиПочтовойРассылки</name>
  <resources>
    <name>Выключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРассылки</name>
    <type>
      <types>EnumRef.ВидыРассылок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдерсЭлПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>EnumRef.РолиРассылки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/РолиРассылки/РолиРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиРассылки</name>
  <enumValues>
    <name>Наблюдатель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>Ответственный</name>
  </enumValues>
  <enumValues>
    <name>Согласующий</name>
  </enumValues>
</mdclass:Enum>

RSN/src/InformationRegisters/УчастникиПочтовойРассылки/ManagerModule.bsl
#Область Интерфейс
Функция ПолучитьЗначенияПоУмолчанию(ВидРассылки = Неопределено) Экспорт
	Ответ = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчастникиПочтовойРассылки.Пользователь КАК Пользователь,
	               |	УчастникиПочтовойРассылки.АдерсЭлПочты КАК АдерсЭлПочты,
	               |	УчастникиПочтовойРассылки.ВидРассылки КАК ВидРассылки,
	               |	УчастникиПочтовойРассылки.ПоУмолчанию КАК ПоУмолчанию,
	               |	УчастникиПочтовойРассылки.Роль КАК Роль
	               |ИЗ
	               |	РегистрСведений.УчастникиПочтовойРассылки КАК УчастникиПочтовойРассылки
	               |ГДЕ
	               |	УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки";
	Если ВидРассылки = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки","Истина");  
	Иначе
		Запрос.УстановитьПараметр("ВидРассылки", ВидРассылки);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Ответ = Запрос.Выполнить().Выгрузить();
	Возврат Ответ;
КонецФункции

Функция ПолучитьСогласующих(ВидРассылки = Неопределено) Экспорт
	Ответ = Новый Массив;    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчастникиПочтовойРассылки.АдерсЭлПочты КАК АдерсЭлПочты
	               |ИЗ
	               |	РегистрСведений.УчастникиПочтовойРассылки КАК УчастникиПочтовойРассылки
	               |ГДЕ
	               |	УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки
	               |	И УчастникиПочтовойРассылки.Роль = &Роль
	               |	И УчастникиПочтовойРассылки.Выключен = ЛОЖЬ";
	Если ВидРассылки = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки","Истина");  
	Иначе
		Запрос.УстановитьПараметр("ВидРассылки", ВидРассылки);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Роль", ПредопределенноеЗначение("Перечисление.РолиРассылки.Согласующий"));	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	//Ответ = Результат.ВыгрузитьКолонку("АдерсЭлПочты");
	Ответ.Добавить("Nikolay.Ivanov@phoenixtrading.ltd");
	//Ответ.Вставить("lyudmila.mirchu@phoenixtrading.ltd");
	Возврат Ответ;
КонецФункции

Функция ПолучитьНаблюдателей(ВидРассылки = Неопределено) Экспорт
	Ответ = Новый Массив;    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчастникиПочтовойРассылки.АдерсЭлПочты КАК АдерсЭлПочты
	               |ИЗ
	               |	РегистрСведений.УчастникиПочтовойРассылки КАК УчастникиПочтовойРассылки
	               |ГДЕ
	               |	УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки
	               |	И УчастникиПочтовойРассылки.Роль = &Роль
	               |	И УчастникиПочтовойРассылки.Выключен = ЛОЖЬ";
	Если ВидРассылки = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"УчастникиПочтовойРассылки.ВидРассылки = &ВидРассылки","Истина");  
	Иначе
		Запрос.УстановитьПараметр("ВидРассылки", ВидРассылки);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Роль", ПредопределенноеЗначение("Перечисление.РолиРассылки.Наблюдатель"));	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	Ответ = Результат.ВыгрузитьКолонку("АдерсЭлПочты");
	//Ответ = Запрос.Выполнить().Выгрузить();
	Ответ.Добавить("Nikolay.Ivanov@phoenixtrading.ltd");
	//Ответ.Вставить("lyudmila.mirchu@phoenixtrading.ltd");
	Возврат Ответ;
КонецФункции

#КонецОбласти
